<br><br><center><h1 style="font-size:2em;color:#2467C0">Tagesaufgaben 05.04.2023</h1></center>
<br>

<div  class="alert alert-block alert-info">
1. Du hast einen Dataframe mit Schülernoten zu verschiedenen Fächern vorliegen. Benutze pivot, um folgenden Output zu erhalten:

    Output:
    Fach       Deutsch  Englisch  Mathematik
    Name
    Alexander      1.3       1.7         1.0
    Anna           1.0       1.7         1.3
    Lisa           2.3       3.0         2.7
    Max            1.7       2.3         2.0
</div>

In [53]:
import pandas as pd

noten_df = pd.DataFrame({
    "Name": ["Max", "Max", "Max", "Anna", "Anna", "Anna", "Lisa", "Lisa", "Lisa", "Alexander", "Alexander", "Alexander"],
    "Fach": ["Mathematik", "Deutsch", "Englisch","Mathematik", "Deutsch", "Englisch","Mathematik", "Deutsch", "Englisch","Mathematik", "Deutsch", "Englisch"],
    "Note": [2.0, 1.7, 2.3, 1.3, 1.0, 1.7, 2.7, 2.3, 3.0, 1.0, 1.3, 1.7]

})
noten_df

         Name        Fach  Note
0         Max  Mathematik   2.0
1         Max     Deutsch   1.7
2         Max    Englisch   2.3
3        Anna  Mathematik   1.3
4        Anna     Deutsch   1.0
5        Anna    Englisch   1.7
6        Lisa  Mathematik   2.7
7        Lisa     Deutsch   2.3
8        Lisa    Englisch   3.0
9   Alexander  Mathematik   1.0
10  Alexander     Deutsch   1.3
11  Alexander    Englisch   1.7

In [9]:
pivot_df = noten_df.pivot(index='Name', columns='Fach', values='Note')

In [11]:
print(pivot_df)

Fach       Deutsch  Englisch  Mathematik
Name
Alexander      1.3       1.7         1.0
Anna           1.0       1.7         1.3
Lisa           2.3       3.0         2.7
Max            1.7       2.3         2.0

<div  class="alert alert-block alert-info">
2. Dir liegt ein Dataframe mit Tech-Produkten vor. Du möchtest diesen ins Long-Format überführen. Nutze dafür melt, um folgenden Output zu erhalten:

    Output:
              Land      Produkt  Verkaufszahl
    0      Deutschland  MacBook          1200
    1              USA  MacBook          2000
    2            Japan  MacBook           800
    3   Großbritannien  MacBook          1000
    4      Deutschland   Lenovo          1500
    5              USA   Lenovo          1800
    6            Japan   Lenovo           900
    7   Großbritannien   Lenovo          1200
    8      Deutschland     Dell           800
    9              USA     Dell          1200
    10           Japan     Dell           700
    11  Großbritannien     Dell           600

</div>

In [10]:
tech = {
    'Land': ['Deutschland', 'USA', 'Japan', 'Großbritannien'],
    'MacBook': [1200, 2000, 800, 1000],
    'Lenovo': [1500, 1800, 900, 1200],
    'Dell': [800, 1200, 700, 600]
}
tech_df = pd.DataFrame(tech)
tech_df

             Land  MacBook  Lenovo  Dell
0     Deutschland     1200    1500   800
1             USA     2000    1800  1200
2           Japan      800     900   700
3  Großbritannien     1000    1200   600

In [12]:
melt_df = pd.melt(tech_df, id_vars=['Land'])

print(melt_df)

              Land variable  value
0      Deutschland  MacBook   1200
1              USA  MacBook   2000
2            Japan  MacBook    800
3   Großbritannien  MacBook   1000
4      Deutschland   Lenovo   1500
5              USA   Lenovo   1800
6            Japan   Lenovo    900
7   Großbritannien   Lenovo   1200
8      Deutschland     Dell    800
9              USA     Dell   1200
10           Japan     Dell    700
11  Großbritannien     Dell    600

<div  class="alert alert-block alert-info">
3. Dir liegt ein Dataframe mit weiteren Tech-Produkten vor. Dein Output soll so aussehen:

    Output:
    Quartal                  Q1
    Land        Produkt
    Deutschland Adapter     700
                Maus        800
                Tastatur   1000
                USB-Stick   900
    Japan       Adapter     700
                Maus        900
                Tastatur    800
                USB-Stick  1000
    USA         Adapter    1000
                Maus       1200
                Tastatur   2000
                USB-Stick  1500
<div  class="alert alert-block alert-info">
Wie gehst du vor?

</div>

In [52]:
# Erstellen eines DataFrames mit Beispiel-Daten
data = {
    'Land': ['USA', 'USA', 'USA', 'USA', 'Deutschland', 'Deutschland', 'Deutschland', 'Deutschland', 'Japan','Japan', 'Japan', 'Japan'],
    'Produkt': ['USB-Stick', 'Tastatur', 'Maus', 'Adapter', 'USB-Stick', 'Tastatur', 'Maus', 'Adapter', 'USB-Stick', 'Tastatur', 'Maus', 'Adapter'],
    'Quartal': ['Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1'],
    'Verkaufszahl': [1500, 2000, 1200, 1000, 900, 1000, 800, 700, 1000, 800, 900, 700]
}
df = pd.DataFrame(data)

# Umformatieren der Daten mit Pivot
pivot_df = df.pivot(index=['Land', 'Produkt'], columns='Quartal', values='Verkaufszahl')

# Ausgabe des umformatierten DataFrames
print(pivot_df)

Quartal                  Q1
Land        Produkt
Deutschland Adapter     700
            Maus        800
            Tastatur   1000
            USB-Stick   900
Japan       Adapter     700
            Maus        900
            Tastatur    800
            USB-Stick  1000
USA         Adapter    1000
            Maus       1200
            Tastatur   2000
            USB-Stick  1500

In [8]:
import pandas as pd
# Erstellen eines DataFrames mit Beispiel-Daten
data = {
    'Land': ['USA', 'USA', 'USA', 'USA', 'Deutschland', 'Deutschland', 'Deutschland', 'Deutschland', 'Japan','Japan', 'Japan', 'Japan'],
    'Produkt': ['USB-Stick', 'Tastatur', 'Maus', 'Adapter', 'USB-Stick', 'Tastatur', 'Maus', 'Adapter', 'USB-Stick', 'Tastatur', 'Maus', 'Adapter'],
    'Quartal': ['Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1'],
    'Verkaufszahl': [1500, 2000, 1200, 1000, 900, 1000, 800, 700, 1000, 800, 900, 700]
}
df = pd.DataFrame(data)

# Umformatieren der Daten mit Pivot
melt_df = df.melt(id_vars=["Land", "Produkt"], value_vars="Verkaufszahl", var_name="values")
# Ausgabe des umformatierten DataFrames
print(melt_df)

           Land    Produkt        values  value
0           USA  USB-Stick  Verkaufszahl   1500
1           USA   Tastatur  Verkaufszahl   2000
2           USA       Maus  Verkaufszahl   1200
3           USA    Adapter  Verkaufszahl   1000
4   Deutschland  USB-Stick  Verkaufszahl    900
5   Deutschland   Tastatur  Verkaufszahl   1000
6   Deutschland       Maus  Verkaufszahl    800
7   Deutschland    Adapter  Verkaufszahl    700
8         Japan  USB-Stick  Verkaufszahl   1000
9         Japan   Tastatur  Verkaufszahl    800
10        Japan       Maus  Verkaufszahl    900
11        Japan    Adapter  Verkaufszahl    700

<div  class="alert alert-block alert-info">
4. Lade den Titanic-Datensatz (titanic.csv) als titanic_df und lass dir a) die oberen sieben Zeilen ausgeben und b) die zehn unteren.
</div>

In [13]:
titanic_df = pd.read_csv("files\\titanic.csv")

In [14]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [15]:
titanic_df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [16]:
titanic_df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<div  class="alert alert-block alert-info">
4. Verwende die Methode describe(). Was zeigt sie dir an? Was aus der Ausgabe lässt sich sinnvoll interpretieren und welche Information ist unnütz? Kommentiere.
</div>

In [17]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

<div  class="alert alert-block alert-info">
5. Du möchtest alle Daten zu folgender Person: Celotti, Mr. Francesco. Wie stellst du das an?
</div>

In [18]:
print(titanic_df[titanic_df["Name"] == "Celotti, Mr. Francesco"])

    PassengerId  Survived  Pclass                    Name   Sex   Age  SibSp  \
89           90         0       3  Celotti, Mr. Francesco  male  24.0      0

    Parch  Ticket  Fare Cabin Embarked
89      0  343275  8.05   NaN        S

<div  class="alert alert-block alert-info">
6. Du möchtest einen Slice des DataFrames, der nur Passagiere der ersten Klasse enthält. Erreiche das durch Slicing mit einer Bedingung und schreibe das Ergebnis in die Variabel erste_klasse. Lasse dir den head von dieser ausgeben und miss ihre Länge.
</div>

In [19]:
erste_klasse = titanic_df[titanic_df["Pclass"] == 1]

In [20]:
erste_klasse.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

In [21]:
erste_klasse["Pclass"].count() # oder len(erste_klasse["Pclass"])

216

<div  class="alert alert-block alert-info">
7. Diesmal möchtest du zwei Slices des DataFrames: Leute die überlebt haben und Leute, die gestorben sind. Überlebende haben in der Spalte Survived den Wert 1. Die, die nicht überlebt haben, weisen eine 0 auf. Erstelle zwei Dataframes aus den Slices: ueberlebende und tote. Lass dir auch hier die Länge ausgeben. Errechne das Verhältnis von Überlebenden zu Toten. Wenn du Lust hast: Rechne den Wert in Prozent um und runde auf zwei Nachkommastellen.
</div>

In [22]:
ueberlebende = titanic_df[titanic_df["Survived"] == 1]
tote = titanic_df[titanic_df["Survived"] == 0]

In [26]:
print(len(ueberlebende)/len(tote)*100)
print(len(ueberlebende)/(len(tote)+len(ueberlebende))*100)
print(len(tote)/(len(tote)+len(ueberlebende))*100)

62.295081967213115
38.38383838383838
61.61616161616161

In [2]:
print(ueberlebende["Survived"].count())
print(tote["Survived"].count())
print(round(ueberlebende["Survived"].count()/(ueberlebende["Survived"].count()+tote["Survived"].count())*100,2), "%")

NameError: name 'ueberlebende' is not defined

<div  class="alert alert-block alert-info">
8. Du möchtest einen Teil des DataFrames ueberlebende auswählen. Und zwar willst du nur Name, Geschlecht und Alter darin sehen. Wie stellst du das an? Schreibe das Resultat in ueberlebende_kompakt und lasse dir den Inhalt ausgeben.
</div>

In [49]:
ueberlebende_kompakt = ueberlebende[["Name", "Sex", "Age"]]

In [50]:
ueberlebende_kompakt

                                                  Name     Sex   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
..                                                 ...     ...   ...
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0
887                       Graham, Miss. Margaret Edith  female  19.0
889                              Behr, Mr. Karl Howell    male  26.0

[342 rows x 3 columns]

<div  class="alert alert-block alert-info">
9. Speichere ueberlebende_kompakt in ueberlebende_passagiere.csv